public class Main {
    public static void main(String[] args) {
        int x = 12_850;
        int y = 20;
        int b = x / y;
        System.out.println("Итоговый бонус: " + b);











        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}